; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)
  (:functions 	(time-to-walk ?l1 ?l2 - location)
		(time-to-drive ?l1 ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-1-7-241)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	p4-0 - location
	p4-5 - location
	p2-0 - location
	p2-4 - location
	p0-5 - location
	p1-0 - location
	p1-5 - location
	p3-4 - location
	p3-5 - location
	)
	(:init
	(at driver1 s1)
	(at driver2 s0)
	(at driver3 s5)
	(at driver4 s3)
	(at driver5 s1)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at package1 s3)
	(at package2 s4)
	(at package3 s4)
	(at package4 s4)
	(at package5 s0)
	(at package6 s2)
	(at package7 s2)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(= (time-to-walk s4 p4-0) 6)
	(= (time-to-walk p4-0 s4) 6)
	(= (time-to-walk s0 p4-0) 14)
	(= (time-to-walk p4-0 s0) 14)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 12)
	(= (time-to-walk p4-5 s4) 12)
	(= (time-to-walk s5 p4-5) 12)
	(= (time-to-walk p4-5 s5) 12)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 23)
	(= (time-to-walk p2-0 s2) 23)
	(= (time-to-walk s0 p2-0) 14)
	(= (time-to-walk p2-0 s0) 14)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 15)
	(= (time-to-walk p2-4 s2) 15)
	(= (time-to-walk s4 p2-4) 15)
	(= (time-to-walk p2-4 s4) 15)
	(path s0 p0-5)
	(path p0-5 s0)
	(path s5 p0-5)
	(path p0-5 s5)
	(= (time-to-walk s0 p0-5) 19)
	(= (time-to-walk p0-5 s0) 19)
	(= (time-to-walk s5 p0-5) 25)
	(= (time-to-walk p0-5 s5) 25)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 4)
	(= (time-to-walk p1-0 s1) 4)
	(= (time-to-walk s0 p1-0) 27)
	(= (time-to-walk p1-0 s0) 27)
	(path s1 p1-5)
	(path p1-5 s1)
	(path s5 p1-5)
	(path p1-5 s5)
	(= (time-to-walk s1 p1-5) 7)
	(= (time-to-walk p1-5 s1) 7)
	(= (time-to-walk s5 p1-5) 40)
	(= (time-to-walk p1-5 s5) 40)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(= (time-to-walk s3 p3-4) 20)
	(= (time-to-walk p3-4 s3) 20)
	(= (time-to-walk s4 p3-4) 30)
	(= (time-to-walk p3-4 s4) 30)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 26)
	(= (time-to-walk p3-5 s3) 26)
	(= (time-to-walk s5 p3-5) 39)
	(= (time-to-walk p3-5 s5) 39)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 5)
	(= (time-to-drive s2 s1) 5)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 7)
	(= (time-to-drive s1 s4) 7)
	(link s3 s0)
	(link s0 s3)
	(= (time-to-drive s3 s0) 6)
	(= (time-to-drive s0 s3) 6)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 16)
	(= (time-to-drive s5 s3) 16)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 39)
	(= (time-to-drive s1 s0) 39)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 18)
	(= (time-to-drive s5 s0) 18)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 6)
	(= (time-to-drive s3 s2) 6)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 39)
	(= (time-to-drive s5 s2) 39)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s1)
	(at driver2 s0)
	(at driver4 s1)
	(at driver5 s4)
	(at truck1 s4)
	(at package1 s4)
	(at package2 s3)
	(at package3 s0)
	(at package5 s4)
	(at package6 s5)
	(at package7 s2)
	))

(:metric minimize (+ (* 3 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (load-truck package6 truck1 s2)
   deleted: (at package6 s2)
   added: (in package6 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 3 of 11
2. (walk driver4 s3 p3-5)
   deleted: (at driver4 s3)
   added: (at driver4 p3-5)
   goals met: 3 of 11
3. (walk driver4 p3-5 s5)
   deleted: (at driver4 p3-5)
   added: (at driver4 s5)
   goals met: 3 of 11
4. (walk driver4 s5 p1-5)
   deleted: (at driver4 s5)
   added: (at driver4 p1-5)
   goals met: 3 of 11
5. (walk driver4 p1-5 s1)
   deleted: (at driver4 p1-5)
   added: (at driver4 s1)
   goals met: 4 of 11
6. (walk driver5 s1 p1-5)
   deleted: (at driver5 s1)
   added: (at driver5 p1-5)
   goals met: 4 of 11
7. (walk driver5 p1-5 s5)
   deleted: (at driver5 p1-5)
   added: (at driver5 s5)
   goals met: 4 of 11
8. (walk driver5 s5 p4-5)
   deleted: (at driver5 s5)
   added: (at driver5 p4-5)
   goals met: 4 of 11
9. (walk driver2 s0 p2-0)
   deleted: (at driver2 s0)
   added: (at driver2 p2-0)
   goals met: 3 of 11
10. (walk driver2 p2-0 s2)
   deleted: (at driver2 p2-0)
   added: (at driver2 s2)
   goals met: 3 of 11
11. (walk driver5 p4-5 s4)
   deleted: (at driver5 p4-5)
   added: (at driver5 s4)
   goals met: 4 of 11
12. (board-truck driver2 truck1 s2)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 4 of 11
13. (drive-truck truck1 s2 s1 driver2)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   changed: (fuel-used) from 0 to 55
   goals met: 4 of 11
14. (drive-truck truck1 s1 s0 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 55 to 484
   goals met: 4 of 11
15. (load-truck package5 truck1 s0)
   deleted: (at package5 s0)
   added: (in package5 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 4 of 11
16. (drive-truck truck1 s0 s1 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (fuel-used) from 484 to 991
   goals met: 4 of 11
17. (drive-truck truck1 s1 s4 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   changed: (fuel-used) from 991 to 1082
   goals met: 5 of 11
18. (unload-truck package5 truck1 s4)
   deleted: (in package5 truck1)
   added: (at package5 s4)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 6 of 11
19. (load-truck package2 truck1 s4)
   deleted: (at package2 s4)
   added: (in package2 truck1)
   changed: (load truck1) from 1 to 2, (fuel-per-minute truck1) from 11 to 13
   goals met: 6 of 11
20. (drive-truck truck1 s4 s1 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (fuel-used) from 1082 to 1173
   goals met: 5 of 11
21. (drive-truck truck1 s1 s0 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 1173 to 1680
   goals met: 5 of 11
22. (drive-truck truck1 s0 s5 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   changed: (fuel-used) from 1680 to 1914
   goals met: 5 of 11
23. (unload-truck package6 truck1 s5)
   deleted: (in package6 truck1)
   added: (at package6 s5)
   changed: (load truck1) from 2 to 1, (fuel-per-minute truck1) from 13 to 11
   goals met: 6 of 11
24. (drive-truck truck1 s5 s3 driver2)
   deleted: (at truck1 s5)
   added: (at truck1 s3)
   changed: (fuel-used) from 1914 to 2090
   goals met: 6 of 11
25. (unload-truck package2 truck1 s3)
   deleted: (in package2 truck1)
   added: (at package2 s3)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 7 of 11
26. (load-truck package1 truck1 s3)
   deleted: (at package1 s3)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 7 of 11
27. (drive-truck truck1 s3 s0 driver2)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   changed: (fuel-used) from 2090 to 2156
   goals met: 7 of 11
28. (drive-truck truck1 s0 s1 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (fuel-used) from 2156 to 2585
   goals met: 7 of 11
29. (drive-truck truck1 s1 s4 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   changed: (fuel-used) from 2585 to 2662
   goals met: 8 of 11
30. (unload-truck package1 truck1 s4)
   deleted: (in package1 truck1)
   added: (at package1 s4)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 9 of 11
31. (load-truck package3 truck1 s4)
   deleted: (at package3 s4)
   added: (in package3 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 9 of 11
32. (drive-truck truck1 s4 s1 driver2)
   deleted: (at truck1 s4)
   added: (at truck1 s1)
   changed: (fuel-used) from 2662 to 2739
   goals met: 8 of 11
33. (drive-truck truck1 s1 s0 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   changed: (fuel-used) from 2739 to 3168
   goals met: 8 of 11
34. (unload-truck package3 truck1 s0)
   deleted: (in package3 truck1)
   added: (at package3 s0)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 9 of 11
35. (drive-truck truck1 s0 s1 driver2)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   changed: (fuel-used) from 3168 to 3558
   goals met: 9 of 11
36. (drive-truck truck1 s1 s4 driver2)
   deleted: (at truck1 s1)
   added: (at truck1 s4)
   changed: (fuel-used) from 3558 to 3628
   goals met: 10 of 11
37. (disembark-truck driver2 truck1 s4)
   deleted: (driving driver2 truck1)
   added: (at driver2 s4) (empty truck1)
   goals met: 10 of 11
38. (walk driver2 s4 p4-0)
   deleted: (at driver2 s4)
   added: (at driver2 p4-0)
   goals met: 10 of 11
39. (walk driver2 p4-0 s0)
   deleted: (at driver2 p4-0)
   added: (at driver2 s0)
   goals met: 11 of 11
